In [2]:
import pandas as pd
import numpy as np

In [3]:
names = ['John','Shawn','Mike','Tim','Tom','Nick','Jack','Steve','Ricky','Shane','Adam']
dept = ['IT','IT','IT','Sales','Sales','HR','HR','HR','Admin','IT','IT']
sal = np.random.randint(25000,100000,11)

In [4]:
pd.Series(names)

0      John
1     Shawn
2      Mike
3       Tim
4       Tom
5      Nick
6      Jack
7     Steve
8     Ricky
9     Shane
10     Adam
dtype: object

In [5]:
pd.Series(sal, index=names)

John     59832
Shawn    64069
Mike     33852
Tim      25793
Tom      75243
Nick     96597
Jack     46313
Steve    37865
Ricky    41323
Shane    27673
Adam     99565
dtype: int32

In [7]:
pd.Series([sal, names, dept])

0    [59832, 64069, 33852, 25793, 75243, 96597, 463...
1    [John, Shawn, Mike, Tim, Tom, Nick, Jack, Stev...
2    [IT, IT, IT, Sales, Sales, HR, HR, HR, Admin, ...
dtype: object

In [8]:
series = pd.Series(names)

In [9]:
series.shape

(11,)

In [11]:
series.count()

11

In [12]:
series.head()

0     John
1    Shawn
2     Mike
3      Tim
4      Tom
dtype: object

In [14]:
series.head(3)

0     John
1    Shawn
2     Mike
dtype: object

In [13]:
series.tail()

6      Jack
7     Steve
8     Ricky
9     Shane
10     Adam
dtype: object

In [15]:
series.tail(3)

8     Ricky
9     Shane
10     Adam
dtype: object

In [16]:
series[0]

'John'

In [17]:
series[0:4]

0     John
1    Shawn
2     Mike
3      Tim
dtype: object

In [18]:
series_2 = pd.Series(sal, index=names)

In [19]:
series_2.head()

John     59832
Shawn    64069
Mike     33852
Tim      25793
Tom      75243
dtype: int32

In [20]:
series_2[0]

59832

In [21]:
series_2[0:4]

John     59832
Shawn    64069
Mike     33852
Tim      25793
dtype: int32

In [22]:
series_2.index

Index(['John', 'Shawn', 'Mike', 'Tim', 'Tom', 'Nick', 'Jack', 'Steve', 'Ricky',
       'Shane', 'Adam'],
      dtype='object')

In [23]:
series_2 > 50000

John      True
Shawn     True
Mike     False
Tim      False
Tom       True
Nick      True
Jack     False
Steve    False
Ricky    False
Shane    False
Adam      True
dtype: bool

In [24]:
series_2[series_2 > 50000]

John     59832
Shawn    64069
Tom      75243
Nick     96597
Adam     99565
dtype: int32

In [25]:
data = {
    "names" : names,
    "sal" : sal,
    "dept" : dept
}

In [26]:
df = pd.DataFrame(data)

In [28]:
df.head()

   names    sal   dept
0   John  59832     IT
1  Shawn  64069     IT
2   Mike  33852     IT
3    Tim  25793  Sales
4    Tom  75243  Sales

In [29]:
df['names']

0      John
1     Shawn
2      Mike
3       Tim
4       Tom
5      Nick
6      Jack
7     Steve
8     Ricky
9     Shane
10     Adam
Name: names, dtype: object

In [30]:
df['names'].head()

0     John
1    Shawn
2     Mike
3      Tim
4      Tom
Name: names, dtype: object

In [32]:
df.loc[0]

names     John
sal      59832
dept        IT
Name: 0, dtype: object

In [33]:
df.loc[1]

names    Shawn
sal      64069
dept        IT
Name: 1, dtype: object

In [34]:
df.iloc[0]

names     John
sal      59832
dept        IT
Name: 0, dtype: object

In [35]:
df.iloc[1]

names    Shawn
sal      64069
dept        IT
Name: 1, dtype: object

In [37]:
series.loc[0]

'John'

In [38]:
series.loc[0:4]

0     John
1    Shawn
2     Mike
3      Tim
4      Tom
dtype: object

In [39]:
series[0:4]

0     John
1    Shawn
2     Mike
3      Tim
dtype: object

In [43]:
series_2.loc['John']

59832

In [44]:
series_2.iloc[0]

59832

In [45]:
df.loc[0:4]

   names    sal   dept
0   John  59832     IT
1  Shawn  64069     IT
2   Mike  33852     IT
3    Tim  25793  Sales
4    Tom  75243  Sales

In [46]:
df.iloc[0:4]

   names    sal   dept
0   John  59832     IT
1  Shawn  64069     IT
2   Mike  33852     IT
3    Tim  25793  Sales

In [48]:
df[df['sal'] > 50000]

    names    sal   dept
0    John  59832     IT
1   Shawn  64069     IT
4     Tom  75243  Sales
5    Nick  96597     HR
10   Adam  99565     IT

In [49]:
df[df['sal'] > 50000].reset_index()

   index  names    sal   dept
0      0   John  59832     IT
1      1  Shawn  64069     IT
2      4    Tom  75243  Sales
3      5   Nick  96597     HR
4     10   Adam  99565     IT

In [50]:
df[df['sal'] > 50000].reset_index(drop=True)

   names    sal   dept
0   John  59832     IT
1  Shawn  64069     IT
2    Tom  75243  Sales
3   Nick  96597     HR
4   Adam  99565     IT

In [52]:
df[(df['sal'] > 50000) & (df['dept'] == 'IT')]

    names    sal dept
0    John  59832   IT
1   Shawn  64069   IT
10   Adam  99565   IT